src/Reports/инкНалоговоеУведомление/инкНалоговоеУведомление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>инкНалоговоеУведомление</name>
</mdclass:Report>

src/InformationRegisters/инкНалоговыеУведомления/инкНалоговыеУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкНалоговыеУведомления</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>АвансНДФЛСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВзносыСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДФЛСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/инкНалоговоеУведомление/ObjectModule.bsl
#Область о // Сформировать табличные документы:

Функция СформироватьТабличныеДокументы(ПараметрыОтчета) Экспорт
	
	ТабличныеДокументы = Новый Структура;
	ТабличныеДокументы.Вставить("ТитульныйЛист",ПолучитьТитульныйЛист(ПараметрыОтчета));
	ТабличныеДокументы.Вставить("ИсчисленныйНалог",ПолучитьИсчисленныйНалог(ПараметрыОтчета));
	
	Возврат ТабличныеДокументы;
	
КонецФункции

Функция ПолучитьТитульныйЛист(ПараметрыОтчета)

	ТитульныйЛист = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Печать_Форма2023_1_Титульная");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ИНН, 12, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИННШапка",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("КППШапка",ВыводСтрока,ОбластьОтчета);

	ВыводСтрока = ПараметрыОтчета.Организация.Наименование;
	инкОтчетыСервер.ВывестиДанныеВОбласти("НаименованиеОрг",ВыводСтрока,ОбластьОтчета,Истина);
	
	ВыводСтрока = ПараметрыОтчета.Организация.ИФНСКод;
	инкОтчетыСервер.ВывестиДанныеВОбласти("КодНО",ВыводСтрока,ОбластьОтчета);

	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Фамилия;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпФ",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Имя;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпИ",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Отчество;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпО",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = Формат(ТекущаяДата(),"ДФ=ddMMyyyy");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ДАТА_ПОДПИСИ",ВыводСтрока,ОбластьОтчета);
	
	ТитульныйЛист.Вывести(ОбластьОтчета);
	
	Возврат ТитульныйЛист;
	
КонецФункции

Функция ПолучитьИсчисленныйНалог(ПараметрыОтчета)

	ИсчисленныйНалог = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Печать_Форма2023_1_СумИсчНалог");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");         
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ИНН, 12, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИННШапка",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("КППШапка",ВыводСтрока,ОбластьОтчета);   
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НалогСумма) Тогда
		
		КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ДобавитьМесяц(ПараметрыОтчета.ПериодУдержания.ДатаНачала,1));
		
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_1",ВыводСтрока,ОбластьОтчета);   
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_1",ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_1","18210102010011000110",ОбластьОтчета);   
		ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.НалогСумма);
		инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_1",ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("Период_1",КодПериода.КодСФР,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_1",Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_1",Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОтчета.ВзносыСумма) Тогда

		КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ПараметрыОтчета.ПериодУдержания.ДатаНачала);

		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_2",ВыводСтрока,ОбластьОтчета);   
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_2",ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_2","18210201000011000160",ОбластьОтчета);   
		ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.ВзносыСумма);
		инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_2",ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("Период_2",КодПериода.КодСФР,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_2",Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_2",Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
	КонецЕсли;
	
	ИсчисленныйНалог.Вывести(ОбластьОтчета);
	
	Возврат ИсчисленныйНалог;

КонецФункции                 

Функция ПолучитьСтроковоеПредставлениеЧисла(СуммаЧисло,ДлинаСтроки = 18)
	
	СуммаСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(СуммаЧисло,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="), ДлинаСтроки, " ", "Слева");
	СуммаСтрока = СтрЗаменить(СуммаСтрока,".","");
	
	Возврат СуммаСтрока;
	
КонецФункции
	
#КонецОбласти
